hazy1k/CW32-48L/6.官方资料-CW32L031核心板资料/测试例程/Libraries/inc/cw32l031_rcc.h
#define RCC_IT_HSEFAULT                            (bv8)
#define RCC_IT_LSEFAULT                            (bv7)
#define RCC_IT_HSEFAIL                             (bv6)
#define RCC_IT_LSEFAIL                             (bv5)
#define RCC_IT_LSERDY                              (bv4)
#define RCC_IT_LSIRDY                              (bv3)
#define RCC_IT_HSERDY                              (bv1)
#define RCC_IT_HSIRDY                              (bv0)
#define IS_RCC_IT(IT)                              (((IT) & 0xFFFFFFE0 == 0x0UL) && ((IT) != 0x0UL))
#define IS_RCC_GET_IT(IT)                          (((IT) == RCC_IT_HSEFAULT) || \
                                                   ((IT) == RCC_IT_LSEFAULT) || \
                                                   ((IT) == RCC_IT_HSEFAIL) || \
                                                   ((IT) == RCC_IT_LSEFAIL) ||\
                                                   ((IT) == RCC_IT_LSERDY) ||\
                                                   ((IT) == RCC_IT_LSIRDY) ||\
                                                   ((IT) == RCC_IT_HSERDY) ||\
                                                   ((IT) == RCC_IT_HSIRDY))

#define RCC_FLAG_HSISTABLE                         bv11
#define RCC_FLAG_HSESTABLE                         bv12
#define RCC_FLAG_LSISTABLE                         bv14
#define RCC_FLAG_LSESTABLE                         bv15
#define IS_RCC_STABLEFLAG(FLAG)                    (((FLAG) == RCC_FLAG_HSISTABLE) || ((FLAG) == RCC_FLAG_HSESTABLE) ||   \
                                                    ((FLAG) == RCC_FLAG_LSESTABLE) || ((FLAG) == RCC_FLAG_LSISTABLE))




#define RCC_FLAG_PORRST                            bv0
#define RCC_FLAG_LVDRST                            bv3
#define RCC_FLAG_IWDTRST                           bv4
#define RCC_FLAG_WWDTRST                           bv5
#define RCC_FLAG_PINRST                            bv6
#define RCC_FLAG_LOCKUPRST                         bv8
#define RCC_FLAG_SYSRESETREQRST                    bv9
#define RCC_FLAG_ALLRST                            ((uint32_t)0x00000379)
#define IS_RCC_RSTFLAG(FLAG)                       (((FLAG) == RCC_FLAG_PINRST) || ((FLAG) == RCC_FLAG_PORRST) || \
                                                   ((FLAG) == RCC_FLAG_LVDRST) || ((FLAG) == RCC_FLAG_IWDTRST) || \
                                                   ((FLAG) == RCC_FLAG_WWDTRST) || ((FLAG) == RCC_FLAG_LOCKUPRST) || \
                                                   ((FLAG) == RCC_FLAG_SYSRESETREQRST) || ((FLAG) == RCC_FLAG_ALLRST))

#define RCC_AHB_PERIPH_GPIOF                       bv9
#define RCC_AHB_PERIPH_GPIOE                       bv8
#define RCC_AHB_PERIPH_GPIOD                       bv7
#define RCC_AHB_PERIPH_GPIOC                       bv6
#define RCC_AHB_PERIPH_GPIOB                       bv5
#define RCC_AHB_PERIPH_GPIOA                       bv4
#define RCC_AHB_PERIPH_CRC                         bv2
#define RCC_AHB_PERIPH_FLASH                       bv1
#define RCC_AHB_PERIPH_DMA                         bv0
#define IS_RCC_AHB_PERIPH(PERIPH)                  ((((PERIPH) & 0xFFFFF008 ) == 0x00) && ((PERIPH) != 0x00))

#define __RCC_GPIOF_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_GPIOF)
#define __RCC_GPIOE_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_GPIOE)
#define __RCC_GPIOD_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_GPIOD)
#define __RCC_GPIOC_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_GPIOC)
#define __RCC_GPIOB_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_GPIOB)
#define __RCC_GPIOA_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_GPIOA)
#define __RCC_CRC_CLK_ENABLE()                     REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_CRC)
#define __RCC_FLASH_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_FLASH)
#define __RCC_DMA_CLK_ENABLE()                     REGBITS_SET(CW_SYSCTRL->AHBEN, RCC_AHB_PERIPH_DMA)
            
#define __RCC_GPIOF_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_GPIOF))
#define __RCC_GPIOE_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_GPIOE))
#define __RCC_GPIOD_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_GPIOD))
#define __RCC_GPIOC_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_GPIOC))
#define __RCC_GPIOB_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_GPIOB))
#define __RCC_GPIOA_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_GPIOA))
#define __RCC_CRC_CLK_DISABLE()                    (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_CRC))
#define __RCC_FLASH_CLK_DISABLE()                  (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_FLASH))
#define __RCC_DMA_CLK_DISABLE()                    (CW_SYSCTRL->AHBEN &= ~(RCC_AHB_PERIPH_DMA))
            
#define RCC_APB1_PERIPH_LPTIM                      bv15
#define RCC_APB1_PERIPH_I2C1                       bv11
#define RCC_APB1_PERIPH_UART3                      bv8
#define RCC_APB1_PERIPH_UART2                      bv7
#define RCC_APB1_PERIPH_IWDT                       bv5
#define RCC_APB1_PERIPH_WWDT                       bv4
#define RCC_APB1_PERIPH_RTC                        bv3
#define RCC_APB1_PERIPH_GTIM2                      bv2
#define RCC_APB1_PERIPH_GTIM1                      bv1
#define IS_RCC_APB1_PERIPH(PERIPH)                 ((((PERIPH) & 0xFFFF4601 ) == 0x00) && ((PERIPH) != 0x00))
            
#define __RCC_LPTIM_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_LPTIM)
#define __RCC_I2C1_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_I2C1)
#define __RCC_UART3_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_UART3)
#define __RCC_UART2_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_UART2)
#define __RCC_IWDT_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_IWDT)
#define __RCC_WWDT_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_WWDT)
#define __RCC_RTC_CLK_ENABLE()                     REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_RTC)
#define __RCC_GTIM2_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_GTIM2)
#define __RCC_GTIM1_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN1, RCC_APB1_PERIPH_GTIM1)
            
#define __RCC_LPTIM_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_LPTIM))
#define __RCC_I2C1_CLK_DISABLE()                   (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_I2C1))
#define __RCC_UART3_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_UART3))
#define __RCC_UART2_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_UART2))
#define __RCC_IWDT_CLK_DISABLE()                   (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_IWDT))
#define __RCC_WWDT_CLK_DISABLE()                   (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_WWDT))
#define __RCC_RTC_CLK_DISABLE()                    (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_RTC))
#define __RCC_GTIM2_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_GTIM2))
#define __RCC_GTIM1_CLK_DISABLE()                  (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_GTIM1))
            
#define RCC_APB2_PERIPH_AWT                        bv13
#define RCC_APB2_PERIPH_BTIM                       bv12
#define RCC_APB2_PERIPH_UART1                      bv9
#define RCC_APB2_PERIPH_SPI1                       bv8
#define RCC_APB2_PERIPH_ATIM                       bv7
#define RCC_APB2_PERIPH_VC                         bv4
#define RCC_APB2_PERIPH_ADC                        bv2

#define IS_RCC_APB2_PERIPH(PERIPH)                 ((((PERIPH) & 0xFFFFC069 ) == 0x00) && ((PERIPH) != 0x00))

#define __RCC_AWT_CLK_ENABLE()                     REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_AWT)
#define __RCC_BTIM_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_BTIM)
#define __RCC_UART1_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_UART1)
#define __RCC_SPI1_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_SPI1)
#define __RCC_ATIM_CLK_ENABLE()                    REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_ATIM)
#define __RCC_VC_CLK_ENABLE()                      REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_VC)
#define __RCC_ADC_CLK_ENABLE()                     REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_ADC)
            
            
#define __RCC_AWT_CLK_DISABLE()                    (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_AWT))
#define __RCC_BTIM_CLK_DISABLE()                   (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_BTIM))
#define __RCC_UART1_CLK_DISABLE()                  (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_UART1))
#define __RCC_SPI1_CLK_DISABLE()                   (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_SPI1))
#define __RCC_ATIM_CLK_DISABLE()                   (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_ATIM))
#define __RCC_VC_CLK_DISABLE()                     (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_VC))
#define __RCC_ADC_CLK_DISABLE()                    (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_ADC))

#define RCC_MCO_DIV1                               (0x00U)
#define RCC_MCO_DIV2                               ((uint8_t)(0x01U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV8                               ((uint8_t)(0x02U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV64                              ((uint8_t)(0x03U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV128                             ((uint8_t)(0x04U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV256                             ((uint8_t)(0x05U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV512                             ((uint8_t)(0x06U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV1024                            ((uint8_t)(0x07U << SYSCTRL_MCO_DIV_Pos))

#define IS_RCC_MCO_DIV(INSTANCE)                   (((INSTANCE) == RCC_MCO_DIV1)          ||\
                                                   ((INSTANCE) == RCC_MCO_DIV2)          ||\
                                                   ((INSTANCE) == RCC_MCO_DIV8)          ||\
                                                   ((INSTANCE) == RCC_MCO_DIV64)         ||\
                                                   ((INSTANCE) == RCC_MCO_DIV128)        ||\
                                                   ((INSTANCE) == RCC_MCO_DIV256)        ||\
                                                   ((INSTANCE) == RCC_MCO_DIV512)        ||\
                                                   ((INSTANCE) == RCC_MCO_DIV1024))

#define RCC_MCO_SRC_NONE                           (0x00U)
#define RCC_MCO_SRC_HCLK                           (0x01U)
#define RCC_MCO_SRC_PCLK                           (0x02U)
#define RCC_MCO_SRC_HSI                            (0x03U)
#define RCC_MCO_SRC_LSI                            (0x04U)
#define RCC_MCO_SRC_HSE                            (0x05U)
#define RCC_MCO_SRC_LSE                            (0x06U)
#define RCC_MCO_SRC_RC150K                         (0x08U)
#define RCC_MCO_SRC_RC10K                          (0x09U)

#define IS_RCC_MCO_SRC(INSTANCE)                   (((INSTANCE) == RCC_MCO_SRC_NONE)       || \
                                                   ((INSTANCE) == RCC_MCO_SRC_HCLK)       || \
                                                   ((INSTANCE) == RCC_MCO_SRC_PCLK)       || \
                                                   ((INSTANCE) == RCC_MCO_SRC_HSI)        || \
                                                   ((INSTANCE) == RCC_MCO_SRC_LSI)        || \
                                                   ((INSTANCE) == RCC_MCO_SRC_HSE)        || \
                                                   ((INSTANCE) == RCC_MCO_SRC_LSE)        || \
                                                   ((INSTANCE) == RCC_MCO_SRC_RC150K)     || \
                                                   ((INSTANCE) == RCC_MCO_SRC_RC10K))

#define RCC_TIMITR_BTIM1                           (0UL)
#define RCC_TIMITR_BTIM2                           (1UL)
#define RCC_TIMITR_BTIM3                           (2UL)
#define RCC_TIMITR_GTIM1                           (3UL)
#define RCC_TIMITR_GTIM2                           (4UL)
#define RCC_TIMITR_ATIM                            (7UL)

#define IS_RCC_TIMITR_SOURCE(SRC)                  ((SRC) < 8)


//==================================================================================
extern void RCC_HCLKPRS_Config(uint32_t HCLKPRS);
extern void RCC_PCLKPRS_Config(uint32_t PCLKPRS);
extern void RCC_SYSCLKSRC_Config(uint32_t SYSCLKSRC);
extern void RCC_CCS_Config(uint32_t CCS, FunctionalState NewState);
extern void RCC_LSELOCK_Config(uint32_t LSELOCK);
extern void RCC_WAKEUPCLK_Config(uint32_t WAKEUPCLK);
extern void RCC_LOCKUP_Config(uint32_t LOCKUP);
extern void RCC_SWDIO_Config(uint32_t SWDIO);
extern void RCC_DeInit(void);
extern void RCC_SystemCoreClockUpdate(uint32_t NewFreq);
extern void RCC_HSI_Enable(uint32_t HSIDiv);
extern void RCC_HSI_Disable(void);
extern void RCC_LSI_Enable(void);
extern void RCC_LSI_Disable(void);
extern void RCC_HSE_Enable(uint32_t Mode, uint32_t FreqIn, uint8_t Driver, uint32_t Flt);
extern void RCC_HSE_Disable(void);
extern void RCC_LSE_Enable(uint32_t Mode, uint8_t Amp, uint8_t Driver);
extern void RCC_LSE_Disable(void);
extern uint8_t RCC_SysClk_Switch(uint32_t NewClk);
extern void RCC_ITConfig(uint32_t RCC_IT, FunctionalState NewState);
extern ITStatus RCC_GetITStatus(uint32_t RCC_IT);
extern void RCC_ClearITPendingBit(uint32_t RCC_IT);
extern FlagStatus RCC_GetStableFlag(uint32_t RCC_STABLEFLAG);
extern uint32_t RCC_GetAllStableFlag(void);
extern void RCC_AHBPeriphClk_Enable(uint32_t Periph, FunctionalState NewState);
extern void RCC_APBPeriphClk_Enable1(uint32_t Periph, FunctionalState NewState);
extern void RCC_APBPeriphClk_Enable2(uint32_t Periph, FunctionalState NewState);
extern void RCC_AHBPeriphReset(uint32_t Periph, FunctionalState NewState);
extern void RCC_APBPeriphReset1(uint32_t Periph, FunctionalState NewState);
extern void RCC_APBPeriphReset2(uint32_t Periph, FunctionalState NewState);
extern FlagStatus RCC_GetRstFlag(uint32_t RCC_RSTFLAG);
extern uint32_t RCC_GetAllRstFlag(void);
extern void RCC_ClearRstFlag(uint32_t RCC_RSTFLAG);
extern void RCC_HCLK_OUT(void);
extern void RCC_PCLK_OUT(void);
extern void RCC_HSE_OUT(void);
extern void RCC_HSI_OUT(void);
extern void RCC_LSE_OUT(void);
extern void RCC_LSI_OUT(void);
extern void RCC_MCO_OUT(uint8_t Source, uint8_t Div);

extern uint32_t RCC_Sysctrl_GetHClkFreq(void);
extern uint32_t RCC_Sysctrl_GetPClkFreq(void);

void RCC_BTIM3ITRSelect(uint32_t Source);
void RCC_BTIM2ITRSelect(uint32_t Source);
void RCC_BTIM1ITRSelect(uint32_t Source);
void RCC_GTIM1ITRSelect(uint32_t Source);
void RCC_GTIM2ITRSelect(uint32_t Source);
void RCC_ATIMITRSelect(uint32_t Source);


#ifdef __cplusplus
}
#endif

#endif /* __CW32L031_RCC_H */
